//
//  TENHumanTests.h
//  HomeworkC
//
//  Created by 444ten on 2/17/15.
//  Copyright (c) 2015 444ten. All rights reserved.
//

//1. Создать объектную структуру данных человек, имеющую поля
//      имя, возраст, пол, количество детей, женат или нет,
//      указатель на партнера, на родителей и на массив с детьми, где могло бы быть, максимум, 20 детей.
//Требования:
//- каждая из сущностей, будь то строка или массив, должны быть обернуты в свой объект,
//       который, как минимум, умел бы выполнять подсчет ссылок и имел базовые аксессоры и тесты;
//- реализовать подсчет ссылок, геттеры и сеттеры для полей;
//- реализовать метод жениться, который бы устанавливал поле женат
//    в true и указатель на партнера, с которым был брак;
//- реализовать метод развестись, который бы устанавливал поле женат и указатель на партнера;
//- реализовать метод произвести потомство, который бы создавал ребенка,
//        устанавливал ему родителей, а у родителей добавлял бы ребенка;
//- создать тесты на все поведение человека.



#ifndef __HomeworkC__TENHumanTests__
#define __HomeworkC__TENHumanTests__

extern
void TENHumanPerformTests();


#endif /* defined(__HomeworkC__TENHumanTests__) */
